[
  {
    "title": "Minced Molokhia - Frozen",
    "s_desc": "Discover the authentic taste of minced Molokhia, a Middle Eastern delicacy, now available at your fingertips!",
    "desc": "Indulge in the rich flavors of Middle Eastern cuisine with our minced Molokhia. Sourced from the finest ingredients, this traditional dish offers a harmonious blend of finely chopped Molokhia leaves, infused with aromatic spices and herbs. Whether you're a connoisseur of exotic flavors or a curious food enthusiast, our minced Molokhia promises to elevate your culinary experience with its unique taste and cultural heritage. Add depth to your meals and explore the vibrant culinary traditions of the Middle East with each savory bite of our meticulously prepared minced Molokhia.",
    "img": "images/products/frozen_vegetables/minced_molokhia.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.40,
    "price": 1.30,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Okra - Frozen",
    "s_desc": "Experience convenience and freshness with our frozen okra, perfect for wholesome meals anytime!",
    "desc": "Introducing our frozen okra, a versatile addition to your kitchen repertoire. Harvested at peak freshness, our okra is carefully selected, sliced, and frozen to preserve its natural flavor and nutrients. Whether you're crafting a savory gumbo, a tangy curry, or a crisp stir-fry, our frozen okra ensures convenience without compromising on taste or quality. Elevate your culinary creations with the vibrant color and tender texture of our premium okra, ready to transform any dish into a wholesome and satisfying meal. Embrace the ease of meal preparation without sacrificing freshness with our frozen okra, your go-to ingredient for flavorful and nutritious dishes.",
    "img": "images/products/frozen_vegetables/okra.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.40,
    "price": 2.20,
    "sale": 2.00,
    "cat": "Frozen Vegetables",
    "added": 20240503
  },
  {
    "title": "Green Beans - Frozen",
    "s_desc": "Experience the taste of Africa with our frozen attieke, bringing authentic flavor to your kitchen!",
    "desc": "Transport your taste buds to the heart of Africa with our frozen attieke, a culinary delight ready to elevate your meals. Made from premium cassava, our attieke is meticulously prepared and frozen to preserve its authentic texture and taste. Whether served as a satisfying side dish or as the star of your meal, our frozen attieke offers the perfect balance of lightness and flavor, embodying the rich culinary heritage of the continent. Unlock the essence of African cuisine in your own kitchen with the convenience of our frozen attieke, adding a touch of tradition and authenticity to every bite.",
    "img": "images/products/frozen_vegetables/green_beans.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.40,
    "price": 2.00,
    "featured": true,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Attiéké - Frozen",
    "s_desc": "Experience the taste of Africa with our frozen attiéké, bringing authentic flavor to your kitchen!",
    "desc": "Transport your taste buds to the heart of Africa with our frozen attiéké, a culinary delight ready to elevate your meals. Made from premium cassava, our attiéké is meticulously prepared and frozen to preserve its authentic texture and taste. Whether served as a satisfying side dish or as the star of your meal, our frozen attiéké offers the perfect balance of lightness and flavor, embodying the rich culinary heritage of the continent. Unlock the essence of African cuisine in your own kitchen with the convenience of our frozen attiéké, adding a touch of tradition and authenticity to every bite.",
    "img": "images/products/frozen_vegetables/attiéké.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.50,
    "price": 2.00,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Kwanga - Frozen",
    "s_desc": "Embark on a flavor journey with our frozen kwanga, bringing the taste of Central Africa to your table!",
    "desc": "Experience the essence of Central African cuisine with our frozen kwanga, a culinary treasure waiting to be discovered. Crafted from the finest ingredients and traditional methods, our kwanga is expertly prepared and frozen to preserve its authentic taste and texture. Whether enjoyed as a standalone delight or paired with your favorite dishes, our frozen kwanga offers a delightful blend of flavor and versatility. Dive into the rich culinary heritage of Central Africa with each bite of our frozen kwanga, adding a touch of exoticism and tradition to your dining experience.",
    "img": "images/products/frozen_vegetables/kwanga.webp",
    "stock": true,
    "uom": "KG",
    "quantity": "1.50 (approx.)",
    "price": 6.00,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Ngai Ngai - Frozen",
    "s_desc": "Savor the taste of tradition with our frozen ngai ngai, a flavorful staple of Central African cuisine!",
    "desc": "Delight in the authentic flavors of Central Africa with our frozen ngai ngai, meticulously prepared to capture the essence of traditional cuisine. Harvested at peak freshness, our ngai ngai is expertly frozen to preserve its unique taste and nutritional value. Whether incorporated into stews, soups, or enjoyed as a side dish, our frozen ngai ngai offers a burst of flavor and texture that embodies the rich culinary heritage of the region. Elevate your meals with the convenience and authenticity of our frozen ngai ngai, bringing a taste of tradition to your table with every serving.",
    "img": "images/products/frozen_vegetables/ngai_ngai.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.40,
    "price": 2.00,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Colocasia - Frozen",
    "s_desc": "Unlock the culinary magic of the tropics with our frozen colocasia, perfect for adding exotic flair to your dishes!",
    "desc": "Transport your taste buds to tropical paradise with our frozen colocasia, a delicious addition to your culinary repertoire. Sourced from the lush tropics, our colocasia is carefully selected, cleaned, and frozen to preserve its natural taste and texture. Whether you're creating traditional dishes or experimenting with new flavors, our frozen colocasia offers versatility and convenience without compromising on quality. Dive into the exotic flavors of the tropics with each bite of our meticulously prepared frozen colocasia, adding a touch of tropical flair to your meals.",
    "img": "images/products/frozen_vegetables/colocasia.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.40,
    "price": 2.00,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Fumbwa - Frozen",
    "s_desc": "Experience the essence of Central African cuisine with our frozen fumbwa, bringing exotic flavors to your table!",
    "desc": "Embark on a culinary adventure with our frozen fumbwa, a traditional delicacy from Central Africa. Handpicked and frozen at the peak of freshness, our fumbwa retains its unique taste and nutritional value, ready to enhance your meals with its exotic flavors. Whether simmered in savory stews or sautéed as a side dish, our frozen fumbwa offers a delightful blend of texture and taste that embodies the rich culinary heritage of the region. Elevate your dining experience with the convenience and authenticity of our frozen fumbwa, adding a touch of African flair to every plate.",
    "img": "images/products/frozen_vegetables/fumbwa.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.20,
    "price": 2.00,
    "cat": "Frozen Vegetables",
    "added": 20240430
  },
  {
    "title": "Saka Saka Congo - Frozen",
    "s_desc": "Bring home the taste of the Congo with our frozen saka saka, a flavorful addition to your culinary journey!",
    "desc": "Explore the vibrant flavors of Congolese cuisine with our frozen saka saka. Harvested and prepared with care, our saka saka is frozen at its freshest, preserving its authentic taste and nutritional benefits. Whether incorporated into traditional recipes or used as a creative twist in your own dishes, our frozen saka saka offers versatility and convenience without compromising on quality. Dive into the rich culinary traditions of the Congo with each serving of our meticulously prepared frozen saka saka, adding depth and flavor to your culinary creations.",
    "img": "images/products/frozen_vegetables/saka_saka_congo.webp",
    "stock": true,
    "uom": "KG",
    "quantity": 0.40,
    "price": 2.00,
    "cat": "Frozen Vegetables",
    "added": 20240430
  }
]